GopalSaraf/Practicals/PSDL/include/proc/pic18f66j99.inc
// Register: RPOR12_13
#define RPOR12_13 RPOR12_13
RPOR12_13                                equ 0E18h
// bitfield definitions
RPOR12_13_RPO12R_POSN                    equ 0000h
RPOR12_13_RPO12R_POSITION                equ 0000h
RPOR12_13_RPO12R_SIZE                    equ 0004h
RPOR12_13_RPO12R_LENGTH                  equ 0004h
RPOR12_13_RPO12R_MASK                    equ 000Fh
RPOR12_13_RPO13R_POSN                    equ 0004h
RPOR12_13_RPO13R_POSITION                equ 0004h
RPOR12_13_RPO13R_SIZE                    equ 0004h
RPOR12_13_RPO13R_LENGTH                  equ 0004h
RPOR12_13_RPO13R_MASK                    equ 00F0h
RPOR12_13_RPO12R0_POSN                   equ 0000h
RPOR12_13_RPO12R0_POSITION               equ 0000h
RPOR12_13_RPO12R0_SIZE                   equ 0001h
RPOR12_13_RPO12R0_LENGTH                 equ 0001h
RPOR12_13_RPO12R0_MASK                   equ 0001h
RPOR12_13_RPO12R1_POSN                   equ 0001h
RPOR12_13_RPO12R1_POSITION               equ 0001h
RPOR12_13_RPO12R1_SIZE                   equ 0001h
RPOR12_13_RPO12R1_LENGTH                 equ 0001h
RPOR12_13_RPO12R1_MASK                   equ 0002h
RPOR12_13_RPO12R2_POSN                   equ 0002h
RPOR12_13_RPO12R2_POSITION               equ 0002h
RPOR12_13_RPO12R2_SIZE                   equ 0001h
RPOR12_13_RPO12R2_LENGTH                 equ 0001h
RPOR12_13_RPO12R2_MASK                   equ 0004h
RPOR12_13_RPO12R3_POSN                   equ 0003h
RPOR12_13_RPO12R3_POSITION               equ 0003h
RPOR12_13_RPO12R3_SIZE                   equ 0001h
RPOR12_13_RPO12R3_LENGTH                 equ 0001h
RPOR12_13_RPO12R3_MASK                   equ 0008h
RPOR12_13_RPO13R0_POSN                   equ 0004h
RPOR12_13_RPO13R0_POSITION               equ 0004h
RPOR12_13_RPO13R0_SIZE                   equ 0001h
RPOR12_13_RPO13R0_LENGTH                 equ 0001h
RPOR12_13_RPO13R0_MASK                   equ 0010h
RPOR12_13_RPO13R1_POSN                   equ 0005h
RPOR12_13_RPO13R1_POSITION               equ 0005h
RPOR12_13_RPO13R1_SIZE                   equ 0001h
RPOR12_13_RPO13R1_LENGTH                 equ 0001h
RPOR12_13_RPO13R1_MASK                   equ 0020h
RPOR12_13_RPO13R2_POSN                   equ 0006h
RPOR12_13_RPO13R2_POSITION               equ 0006h
RPOR12_13_RPO13R2_SIZE                   equ 0001h
RPOR12_13_RPO13R2_LENGTH                 equ 0001h
RPOR12_13_RPO13R2_MASK                   equ 0040h
RPOR12_13_RPO13R3_POSN                   equ 0007h
RPOR12_13_RPO13R3_POSITION               equ 0007h
RPOR12_13_RPO13R3_SIZE                   equ 0001h
RPOR12_13_RPO13R3_LENGTH                 equ 0001h
RPOR12_13_RPO13R3_MASK                   equ 0080h

// Register: RPOR14_15
#define RPOR14_15 RPOR14_15
RPOR14_15                                equ 0E19h
// bitfield definitions
RPOR14_15_RPO14R_POSN                    equ 0000h
RPOR14_15_RPO14R_POSITION                equ 0000h
RPOR14_15_RPO14R_SIZE                    equ 0004h
RPOR14_15_RPO14R_LENGTH                  equ 0004h
RPOR14_15_RPO14R_MASK                    equ 000Fh
RPOR14_15_RPO15R_POSN                    equ 0004h
RPOR14_15_RPO15R_POSITION                equ 0004h
RPOR14_15_RPO15R_SIZE                    equ 0004h
RPOR14_15_RPO15R_LENGTH                  equ 0004h
RPOR14_15_RPO15R_MASK                    equ 00F0h
RPOR14_15_RPO14R0_POSN                   equ 0000h
RPOR14_15_RPO14R0_POSITION               equ 0000h
RPOR14_15_RPO14R0_SIZE                   equ 0001h
RPOR14_15_RPO14R0_LENGTH                 equ 0001h
RPOR14_15_RPO14R0_MASK                   equ 0001h
RPOR14_15_RPO14R1_POSN                   equ 0001h
RPOR14_15_RPO14R1_POSITION               equ 0001h
RPOR14_15_RPO14R1_SIZE                   equ 0001h
RPOR14_15_RPO14R1_LENGTH                 equ 0001h
RPOR14_15_RPO14R1_MASK                   equ 0002h
RPOR14_15_RPO14R2_POSN                   equ 0002h
RPOR14_15_RPO14R2_POSITION               equ 0002h
RPOR14_15_RPO14R2_SIZE                   equ 0001h
RPOR14_15_RPO14R2_LENGTH                 equ 0001h
RPOR14_15_RPO14R2_MASK                   equ 0004h
RPOR14_15_RPO14R3_POSN                   equ 0003h
RPOR14_15_RPO14R3_POSITION               equ 0003h
RPOR14_15_RPO14R3_SIZE                   equ 0001h
RPOR14_15_RPO14R3_LENGTH                 equ 0001h
RPOR14_15_RPO14R3_MASK                   equ 0008h
RPOR14_15_RPO15R0_POSN                   equ 0004h
RPOR14_15_RPO15R0_POSITION               equ 0004h
RPOR14_15_RPO15R0_SIZE                   equ 0001h
RPOR14_15_RPO15R0_LENGTH                 equ 0001h
RPOR14_15_RPO15R0_MASK                   equ 0010h
RPOR14_15_RPO15R1_POSN                   equ 0005h
RPOR14_15_RPO15R1_POSITION               equ 0005h
RPOR14_15_RPO15R1_SIZE                   equ 0001h
RPOR14_15_RPO15R1_LENGTH                 equ 0001h
RPOR14_15_RPO15R1_MASK                   equ 0020h
RPOR14_15_RPO15R2_POSN                   equ 0006h
RPOR14_15_RPO15R2_POSITION               equ 0006h
RPOR14_15_RPO15R2_SIZE                   equ 0001h
RPOR14_15_RPO15R2_LENGTH                 equ 0001h
RPOR14_15_RPO15R2_MASK                   equ 0040h
RPOR14_15_RPO15R3_POSN                   equ 0007h
RPOR14_15_RPO15R3_POSITION               equ 0007h
RPOR14_15_RPO15R3_SIZE                   equ 0001h
RPOR14_15_RPO15R3_LENGTH                 equ 0001h
RPOR14_15_RPO15R3_MASK                   equ 0080h

// Register: RPOR16_17
#define RPOR16_17 RPOR16_17
RPOR16_17                                equ 0E1Ah
// bitfield definitions
RPOR16_17_RPO16R_POSN                    equ 0000h
RPOR16_17_RPO16R_POSITION                equ 0000h
RPOR16_17_RPO16R_SIZE                    equ 0004h
RPOR16_17_RPO16R_LENGTH                  equ 0004h
RPOR16_17_RPO16R_MASK                    equ 000Fh
RPOR16_17_RPO17R_POSN                    equ 0004h
RPOR16_17_RPO17R_POSITION                equ 0004h
RPOR16_17_RPO17R_SIZE                    equ 0004h
RPOR16_17_RPO17R_LENGTH                  equ 0004h
RPOR16_17_RPO17R_MASK                    equ 00F0h
RPOR16_17_RPO16R0_POSN                   equ 0000h
RPOR16_17_RPO16R0_POSITION               equ 0000h
RPOR16_17_RPO16R0_SIZE                   equ 0001h
RPOR16_17_RPO16R0_LENGTH                 equ 0001h
RPOR16_17_RPO16R0_MASK                   equ 0001h
RPOR16_17_RPO16R1_POSN                   equ 0001h
RPOR16_17_RPO16R1_POSITION               equ 0001h
RPOR16_17_RPO16R1_SIZE                   equ 0001h
RPOR16_17_RPO16R1_LENGTH                 equ 0001h
RPOR16_17_RPO16R1_MASK                   equ 0002h
RPOR16_17_RPO16R2_POSN                   equ 0002h
RPOR16_17_RPO16R2_POSITION               equ 0002h
RPOR16_17_RPO16R2_SIZE                   equ 0001h
RPOR16_17_RPO16R2_LENGTH                 equ 0001h
RPOR16_17_RPO16R2_MASK                   equ 0004h
RPOR16_17_RPO16R3_POSN                   equ 0003h
RPOR16_17_RPO16R3_POSITION               equ 0003h
RPOR16_17_RPO16R3_SIZE                   equ 0001h
RPOR16_17_RPO16R3_LENGTH                 equ 0001h
RPOR16_17_RPO16R3_MASK                   equ 0008h
RPOR16_17_RPO17R0_POSN                   equ 0004h
RPOR16_17_RPO17R0_POSITION               equ 0004h
RPOR16_17_RPO17R0_SIZE                   equ 0001h
RPOR16_17_RPO17R0_LENGTH                 equ 0001h
RPOR16_17_RPO17R0_MASK                   equ 0010h
RPOR16_17_RPO17R1_POSN                   equ 0005h
RPOR16_17_RPO17R1_POSITION               equ 0005h
RPOR16_17_RPO17R1_SIZE                   equ 0001h
RPOR16_17_RPO17R1_LENGTH                 equ 0001h
RPOR16_17_RPO17R1_MASK                   equ 0020h
RPOR16_17_RPO17R2_POSN                   equ 0006h
RPOR16_17_RPO17R2_POSITION               equ 0006h
RPOR16_17_RPO17R2_SIZE                   equ 0001h
RPOR16_17_RPO17R2_LENGTH                 equ 0001h
RPOR16_17_RPO17R2_MASK                   equ 0040h
RPOR16_17_RPO17R3_POSN                   equ 0007h
RPOR16_17_RPO17R3_POSITION               equ 0007h
RPOR16_17_RPO17R3_SIZE                   equ 0001h
RPOR16_17_RPO17R3_LENGTH                 equ 0001h
RPOR16_17_RPO17R3_MASK                   equ 0080h

// Register: RPOR18_19
#define RPOR18_19 RPOR18_19
RPOR18_19                                equ 0E1Bh
// bitfield definitions
RPOR18_19_RPO18R_POSN                    equ 0000h
RPOR18_19_RPO18R_POSITION                equ 0000h
RPOR18_19_RPO18R_SIZE                    equ 0004h
RPOR18_19_RPO18R_LENGTH                  equ 0004h
RPOR18_19_RPO18R_MASK                    equ 000Fh
RPOR18_19_RPO19R_POSN                    equ 0004h
RPOR18_19_RPO19R_POSITION                equ 0004h
RPOR18_19_RPO19R_SIZE                    equ 0004h
RPOR18_19_RPO19R_LENGTH                  equ 0004h
RPOR18_19_RPO19R_MASK                    equ 00F0h
RPOR18_19_RPO18R0_POSN                   equ 0000h
RPOR18_19_RPO18R0_POSITION               equ 0000h
RPOR18_19_RPO18R0_SIZE                   equ 0001h
RPOR18_19_RPO18R0_LENGTH                 equ 0001h
RPOR18_19_RPO18R0_MASK                   equ 0001h
RPOR18_19_RPO18R1_POSN                   equ 0001h
RPOR18_19_RPO18R1_POSITION               equ 0001h
RPOR18_19_RPO18R1_SIZE                   equ 0001h
RPOR18_19_RPO18R1_LENGTH                 equ 0001h
RPOR18_19_RPO18R1_MASK                   equ 0002h
RPOR18_19_RPO18R2_POSN                   equ 0002h
RPOR18_19_RPO18R2_POSITION               equ 0002h
RPOR18_19_RPO18R2_SIZE                   equ 0001h
RPOR18_19_RPO18R2_LENGTH                 equ 0001h
RPOR18_19_RPO18R2_MASK                   equ 0004h
RPOR18_19_RPO18R3_POSN                   equ 0003h
RPOR18_19_RPO18R3_POSITION               equ 0003h
RPOR18_19_RPO18R3_SIZE                   equ 0001h
RPOR18_19_RPO18R3_LENGTH                 equ 0001h
RPOR18_19_RPO18R3_MASK                   equ 0008h
RPOR18_19_RPO19R0_POSN                   equ 0004h
RPOR18_19_RPO19R0_POSITION               equ 0004h
RPOR18_19_RPO19R0_SIZE                   equ 0001h
RPOR18_19_RPO19R0_LENGTH                 equ 0001h
RPOR18_19_RPO19R0_MASK                   equ 0010h
RPOR18_19_RPO19R1_POSN                   equ 0005h
RPOR18_19_RPO19R1_POSITION               equ 0005h
RPOR18_19_RPO19R1_SIZE                   equ 0001h
RPOR18_19_RPO19R1_LENGTH                 equ 0001h
RPOR18_19_RPO19R1_MASK                   equ 0020h
RPOR18_19_RPO19R2_POSN                   equ 0006h
RPOR18_19_RPO19R2_POSITION               equ 0006h
RPOR18_19_RPO19R2_SIZE                   equ 0001h
RPOR18_19_RPO19R2_LENGTH                 equ 0001h
RPOR18_19_RPO19R2_MASK                   equ 0040h
RPOR18_19_RPO19R3_POSN                   equ 0007h
RPOR18_19_RPO19R3_POSITION               equ 0007h
RPOR18_19_RPO19R3_SIZE                   equ 0001h
RPOR18_19_RPO19R3_LENGTH                 equ 0001h
RPOR18_19_RPO19R3_MASK                   equ 0080h

