GopalSaraf/Practicals/PSDL/include/proc/pic18f66j99.inc
// Register: ADCBUF16L
#define ADCBUF16L ADCBUF16L
ADCBUF16L                                equ 0E66h
// bitfield definitions
ADCBUF16L_ADCBUF16L_POSN                 equ 0000h
ADCBUF16L_ADCBUF16L_POSITION             equ 0000h
ADCBUF16L_ADCBUF16L_SIZE                 equ 0008h
ADCBUF16L_ADCBUF16L_LENGTH               equ 0008h
ADCBUF16L_ADCBUF16L_MASK                 equ 00FFh

// Register: ADCBUF16H
#define ADCBUF16H ADCBUF16H
ADCBUF16H                                equ 0E67h
// bitfield definitions
ADCBUF16H_ADCBUF16H_POSN                 equ 0000h
ADCBUF16H_ADCBUF16H_POSITION             equ 0000h
ADCBUF16H_ADCBUF16H_SIZE                 equ 0008h
ADCBUF16H_ADCBUF16H_LENGTH               equ 0008h
ADCBUF16H_ADCBUF16H_MASK                 equ 00FFh

// Register: ADCBUF17
#define ADCBUF17 ADCBUF17
ADCBUF17                                 equ 0E68h

// Register: ADCBUF17L
#define ADCBUF17L ADCBUF17L
ADCBUF17L                                equ 0E68h
// bitfield definitions
ADCBUF17L_ADCBUF17L_POSN                 equ 0000h
ADCBUF17L_ADCBUF17L_POSITION             equ 0000h
ADCBUF17L_ADCBUF17L_SIZE                 equ 0008h
ADCBUF17L_ADCBUF17L_LENGTH               equ 0008h
ADCBUF17L_ADCBUF17L_MASK                 equ 00FFh

// Register: ADCBUF17H
#define ADCBUF17H ADCBUF17H
ADCBUF17H                                equ 0E69h
// bitfield definitions
ADCBUF17H_ADCBUF17H_POSN                 equ 0000h
ADCBUF17H_ADCBUF17H_POSITION             equ 0000h
ADCBUF17H_ADCBUF17H_SIZE                 equ 0008h
ADCBUF17H_ADCBUF17H_LENGTH               equ 0008h
ADCBUF17H_ADCBUF17H_MASK                 equ 00FFh

// Register: ADCBUF18
#define ADCBUF18 ADCBUF18
ADCBUF18                                 equ 0E6Ah

// Register: ADCBUF18L
#define ADCBUF18L ADCBUF18L
ADCBUF18L                                equ 0E6Ah
// bitfield definitions
ADCBUF18L_ADCBUF18L_POSN                 equ 0000h
ADCBUF18L_ADCBUF18L_POSITION             equ 0000h
ADCBUF18L_ADCBUF18L_SIZE                 equ 0008h
ADCBUF18L_ADCBUF18L_LENGTH               equ 0008h
ADCBUF18L_ADCBUF18L_MASK                 equ 00FFh

// Register: ADCBUF18H
#define ADCBUF18H ADCBUF18H
ADCBUF18H                                equ 0E6Bh
// bitfield definitions
ADCBUF18H_ADCBUF18H_POSN                 equ 0000h
ADCBUF18H_ADCBUF18H_POSITION             equ 0000h
ADCBUF18H_ADCBUF18H_SIZE                 equ 0008h
ADCBUF18H_ADCBUF18H_LENGTH               equ 0008h
ADCBUF18H_ADCBUF18H_MASK                 equ 00FFh

// Register: ADCBUF19
#define ADCBUF19 ADCBUF19
ADCBUF19                                 equ 0E6Ch

// Register: ADCBUF19L
#define ADCBUF19L ADCBUF19L
ADCBUF19L                                equ 0E6Ch
// bitfield definitions
ADCBUF19L_ADCBUF19L_POSN                 equ 0000h
ADCBUF19L_ADCBUF19L_POSITION             equ 0000h
ADCBUF19L_ADCBUF19L_SIZE                 equ 0008h
ADCBUF19L_ADCBUF19L_LENGTH               equ 0008h
ADCBUF19L_ADCBUF19L_MASK                 equ 00FFh

// Register: ADCBUF19H
#define ADCBUF19H ADCBUF19H
ADCBUF19H                                equ 0E6Dh
// bitfield definitions
ADCBUF19H_ADCBUF19H_POSN                 equ 0000h
ADCBUF19H_ADCBUF19H_POSITION             equ 0000h
ADCBUF19H_ADCBUF19H_SIZE                 equ 0008h
ADCBUF19H_ADCBUF19H_LENGTH               equ 0008h
ADCBUF19H_ADCBUF19H_MASK                 equ 00FFh

// Register: ADCBUF20
#define ADCBUF20 ADCBUF20
ADCBUF20                                 equ 0E6Eh

// Register: ADCBUF20L
#define ADCBUF20L ADCBUF20L
ADCBUF20L                                equ 0E6Eh
// bitfield definitions
ADCBUF20L_ADCBUF20L_POSN                 equ 0000h
ADCBUF20L_ADCBUF20L_POSITION             equ 0000h
ADCBUF20L_ADCBUF20L_SIZE                 equ 0008h
ADCBUF20L_ADCBUF20L_LENGTH               equ 0008h
ADCBUF20L_ADCBUF20L_MASK                 equ 00FFh

// Register: ADCBUF20H
#define ADCBUF20H ADCBUF20H
ADCBUF20H                                equ 0E6Fh
// bitfield definitions
ADCBUF20H_ADCBUF20H_POSN                 equ 0000h
ADCBUF20H_ADCBUF20H_POSITION             equ 0000h
ADCBUF20H_ADCBUF20H_SIZE                 equ 0008h
ADCBUF20H_ADCBUF20H_LENGTH               equ 0008h
ADCBUF20H_ADCBUF20H_MASK                 equ 00FFh

// Register: ADCBUF21
#define ADCBUF21 ADCBUF21
ADCBUF21                                 equ 0E70h

// Register: ADCBUF21L
#define ADCBUF21L ADCBUF21L
ADCBUF21L                                equ 0E70h
// bitfield definitions
ADCBUF21L_ADCBUF21L_POSN                 equ 0000h
ADCBUF21L_ADCBUF21L_POSITION             equ 0000h
ADCBUF21L_ADCBUF21L_SIZE                 equ 0008h
ADCBUF21L_ADCBUF21L_LENGTH               equ 0008h
ADCBUF21L_ADCBUF21L_MASK                 equ 00FFh

// Register: ADCBUF21H
#define ADCBUF21H ADCBUF21H
ADCBUF21H                                equ 0E71h
// bitfield definitions
ADCBUF21H_ADCBUF21H_POSN                 equ 0000h
ADCBUF21H_ADCBUF21H_POSITION             equ 0000h
ADCBUF21H_ADCBUF21H_SIZE                 equ 0008h
ADCBUF21H_ADCBUF21H_LENGTH               equ 0008h
ADCBUF21H_ADCBUF21H_MASK                 equ 00FFh

// Register: ADCBUF22
#define ADCBUF22 ADCBUF22
ADCBUF22                                 equ 0E72h

// Register: ADCBUF22L
#define ADCBUF22L ADCBUF22L
ADCBUF22L                                equ 0E72h
// bitfield definitions
ADCBUF22L_ADCBUF22L_POSN                 equ 0000h
ADCBUF22L_ADCBUF22L_POSITION             equ 0000h
ADCBUF22L_ADCBUF22L_SIZE                 equ 0008h
ADCBUF22L_ADCBUF22L_LENGTH               equ 0008h
ADCBUF22L_ADCBUF22L_MASK                 equ 00FFh

// Register: ADCBUF22H
#define ADCBUF22H ADCBUF22H
ADCBUF22H                                equ 0E73h
// bitfield definitions
ADCBUF22H_ADCBUF22H_POSN                 equ 0000h
ADCBUF22H_ADCBUF22H_POSITION             equ 0000h
ADCBUF22H_ADCBUF22H_SIZE                 equ 0008h
ADCBUF22H_ADCBUF22H_LENGTH               equ 0008h
ADCBUF22H_ADCBUF22H_MASK                 equ 00FFh

// Register: ADCBUF23
#define ADCBUF23 ADCBUF23
ADCBUF23                                 equ 0E74h

