GopalSaraf/Practicals/PSDL/include/proc/pic18f66j99.inc
// Register: ADCHIT0L
#define ADCHIT0L ADCHIT0L
ADCHIT0L                                 equ 0E7Eh
// bitfield definitions
ADCHIT0L_CHH_POSN                        equ 0000h
ADCHIT0L_CHH_POSITION                    equ 0000h
ADCHIT0L_CHH_SIZE                        equ 0008h
ADCHIT0L_CHH_LENGTH                      equ 0008h
ADCHIT0L_CHH_MASK                        equ 00FFh
ADCHIT0L_CHH0_POSN                       equ 0000h
ADCHIT0L_CHH0_POSITION                   equ 0000h
ADCHIT0L_CHH0_SIZE                       equ 0001h
ADCHIT0L_CHH0_LENGTH                     equ 0001h
ADCHIT0L_CHH0_MASK                       equ 0001h
ADCHIT0L_CHH1_POSN                       equ 0001h
ADCHIT0L_CHH1_POSITION                   equ 0001h
ADCHIT0L_CHH1_SIZE                       equ 0001h
ADCHIT0L_CHH1_LENGTH                     equ 0001h
ADCHIT0L_CHH1_MASK                       equ 0002h
ADCHIT0L_CHH2_POSN                       equ 0002h
ADCHIT0L_CHH2_POSITION                   equ 0002h
ADCHIT0L_CHH2_SIZE                       equ 0001h
ADCHIT0L_CHH2_LENGTH                     equ 0001h
ADCHIT0L_CHH2_MASK                       equ 0004h
ADCHIT0L_CHH3_POSN                       equ 0003h
ADCHIT0L_CHH3_POSITION                   equ 0003h
ADCHIT0L_CHH3_SIZE                       equ 0001h
ADCHIT0L_CHH3_LENGTH                     equ 0001h
ADCHIT0L_CHH3_MASK                       equ 0008h
ADCHIT0L_CHH4_POSN                       equ 0004h
ADCHIT0L_CHH4_POSITION                   equ 0004h
ADCHIT0L_CHH4_SIZE                       equ 0001h
ADCHIT0L_CHH4_LENGTH                     equ 0001h
ADCHIT0L_CHH4_MASK                       equ 0010h
ADCHIT0L_CHH5_POSN                       equ 0005h
ADCHIT0L_CHH5_POSITION                   equ 0005h
ADCHIT0L_CHH5_SIZE                       equ 0001h
ADCHIT0L_CHH5_LENGTH                     equ 0001h
ADCHIT0L_CHH5_MASK                       equ 0020h
ADCHIT0L_CHH6_POSN                       equ 0006h
ADCHIT0L_CHH6_POSITION                   equ 0006h
ADCHIT0L_CHH6_SIZE                       equ 0001h
ADCHIT0L_CHH6_LENGTH                     equ 0001h
ADCHIT0L_CHH6_MASK                       equ 0040h
ADCHIT0L_CHH7_POSN                       equ 0007h
ADCHIT0L_CHH7_POSITION                   equ 0007h
ADCHIT0L_CHH7_SIZE                       equ 0001h
ADCHIT0L_CHH7_LENGTH                     equ 0001h
ADCHIT0L_CHH7_MASK                       equ 0080h

// Register: ADCHIT0H
#define ADCHIT0H ADCHIT0H
ADCHIT0H                                 equ 0E7Fh
// bitfield definitions
ADCHIT0H_CHH_POSN                        equ 0000h
ADCHIT0H_CHH_POSITION                    equ 0000h
ADCHIT0H_CHH_SIZE                        equ 0008h
ADCHIT0H_CHH_LENGTH                      equ 0008h
ADCHIT0H_CHH_MASK                        equ 00FFh
ADCHIT0H_CHH8_POSN                       equ 0000h
ADCHIT0H_CHH8_POSITION                   equ 0000h
ADCHIT0H_CHH8_SIZE                       equ 0001h
ADCHIT0H_CHH8_LENGTH                     equ 0001h
ADCHIT0H_CHH8_MASK                       equ 0001h
ADCHIT0H_CHH9_POSN                       equ 0001h
ADCHIT0H_CHH9_POSITION                   equ 0001h
ADCHIT0H_CHH9_SIZE                       equ 0001h
ADCHIT0H_CHH9_LENGTH                     equ 0001h
ADCHIT0H_CHH9_MASK                       equ 0002h
ADCHIT0H_CHH10_POSN                      equ 0002h
ADCHIT0H_CHH10_POSITION                  equ 0002h
ADCHIT0H_CHH10_SIZE                      equ 0001h
ADCHIT0H_CHH10_LENGTH                    equ 0001h
ADCHIT0H_CHH10_MASK                      equ 0004h
ADCHIT0H_CHH11_POSN                      equ 0003h
ADCHIT0H_CHH11_POSITION                  equ 0003h
ADCHIT0H_CHH11_SIZE                      equ 0001h
ADCHIT0H_CHH11_LENGTH                    equ 0001h
ADCHIT0H_CHH11_MASK                      equ 0008h
ADCHIT0H_CHH12_POSN                      equ 0004h
ADCHIT0H_CHH12_POSITION                  equ 0004h
ADCHIT0H_CHH12_SIZE                      equ 0001h
ADCHIT0H_CHH12_LENGTH                    equ 0001h
ADCHIT0H_CHH12_MASK                      equ 0010h
ADCHIT0H_CHH13_POSN                      equ 0005h
ADCHIT0H_CHH13_POSITION                  equ 0005h
ADCHIT0H_CHH13_SIZE                      equ 0001h
ADCHIT0H_CHH13_LENGTH                    equ 0001h
ADCHIT0H_CHH13_MASK                      equ 0020h
ADCHIT0H_CHH14_POSN                      equ 0006h
ADCHIT0H_CHH14_POSITION                  equ 0006h
ADCHIT0H_CHH14_SIZE                      equ 0001h
ADCHIT0H_CHH14_LENGTH                    equ 0001h
ADCHIT0H_CHH14_MASK                      equ 0040h
ADCHIT0H_CHH15_POSN                      equ 0007h
ADCHIT0H_CHH15_POSITION                  equ 0007h
ADCHIT0H_CHH15_SIZE                      equ 0001h
ADCHIT0H_CHH15_LENGTH                    equ 0001h
ADCHIT0H_CHH15_MASK                      equ 0080h

// Register: ADCHIT1L
#define ADCHIT1L ADCHIT1L
ADCHIT1L                                 equ 0E80h
// bitfield definitions
ADCHIT1L_CHH_POSN                        equ 0000h
ADCHIT1L_CHH_POSITION                    equ 0000h
ADCHIT1L_CHH_SIZE                        equ 0008h
ADCHIT1L_CHH_LENGTH                      equ 0008h
ADCHIT1L_CHH_MASK                        equ 00FFh
ADCHIT1L_CHH16_POSN                      equ 0000h
ADCHIT1L_CHH16_POSITION                  equ 0000h
ADCHIT1L_CHH16_SIZE                      equ 0001h
ADCHIT1L_CHH16_LENGTH                    equ 0001h
ADCHIT1L_CHH16_MASK                      equ 0001h
ADCHIT1L_CHH17_POSN                      equ 0001h
ADCHIT1L_CHH17_POSITION                  equ 0001h
ADCHIT1L_CHH17_SIZE                      equ 0001h
ADCHIT1L_CHH17_LENGTH                    equ 0001h
ADCHIT1L_CHH17_MASK                      equ 0002h
ADCHIT1L_CHH18_POSN                      equ 0002h
ADCHIT1L_CHH18_POSITION                  equ 0002h
ADCHIT1L_CHH18_SIZE                      equ 0001h
ADCHIT1L_CHH18_LENGTH                    equ 0001h
ADCHIT1L_CHH18_MASK                      equ 0004h
ADCHIT1L_CHH19_POSN                      equ 0003h
ADCHIT1L_CHH19_POSITION                  equ 0003h
ADCHIT1L_CHH19_SIZE                      equ 0001h
ADCHIT1L_CHH19_LENGTH                    equ 0001h
ADCHIT1L_CHH19_MASK                      equ 0008h
ADCHIT1L_CHH20_POSN                      equ 0004h
ADCHIT1L_CHH20_POSITION                  equ 0004h
ADCHIT1L_CHH20_SIZE                      equ 0001h
ADCHIT1L_CHH20_LENGTH                    equ 0001h
ADCHIT1L_CHH20_MASK                      equ 0010h
ADCHIT1L_CHH21_POSN                      equ 0005h
ADCHIT1L_CHH21_POSITION                  equ 0005h
ADCHIT1L_CHH21_SIZE                      equ 0001h
ADCHIT1L_CHH21_LENGTH                    equ 0001h
ADCHIT1L_CHH21_MASK                      equ 0020h
ADCHIT1L_CHH22_POSN                      equ 0006h
ADCHIT1L_CHH22_POSITION                  equ 0006h
ADCHIT1L_CHH22_SIZE                      equ 0001h
ADCHIT1L_CHH22_LENGTH                    equ 0001h
ADCHIT1L_CHH22_MASK                      equ 0040h
ADCHIT1L_CHH23_POSN                      equ 0007h
ADCHIT1L_CHH23_POSITION                  equ 0007h
ADCHIT1L_CHH23_SIZE                      equ 0001h
ADCHIT1L_CHH23_LENGTH                    equ 0001h
ADCHIT1L_CHH23_MASK                      equ 0080h

