GopalSaraf/Practicals/PSDL/include/proc/pic18f66j99.inc
// Register: LCDDATA29
#define LCDDATA29 LCDDATA29
LCDDATA29                                equ 0EABh
// bitfield definitions
LCDDATA29_S40C3_POSN                     equ 0000h
LCDDATA29_S40C3_POSITION                 equ 0000h
LCDDATA29_S40C3_SIZE                     equ 0001h
LCDDATA29_S40C3_LENGTH                   equ 0001h
LCDDATA29_S40C3_MASK                     equ 0001h
LCDDATA29_S41C3_POSN                     equ 0001h
LCDDATA29_S41C3_POSITION                 equ 0001h
LCDDATA29_S41C3_SIZE                     equ 0001h
LCDDATA29_S41C3_LENGTH                   equ 0001h
LCDDATA29_S41C3_MASK                     equ 0002h
LCDDATA29_S42C3_POSN                     equ 0002h
LCDDATA29_S42C3_POSITION                 equ 0002h
LCDDATA29_S42C3_SIZE                     equ 0001h
LCDDATA29_S42C3_LENGTH                   equ 0001h
LCDDATA29_S42C3_MASK                     equ 0004h
LCDDATA29_S43C3_POSN                     equ 0003h
LCDDATA29_S43C3_POSITION                 equ 0003h
LCDDATA29_S43C3_SIZE                     equ 0001h
LCDDATA29_S43C3_LENGTH                   equ 0001h
LCDDATA29_S43C3_MASK                     equ 0008h
LCDDATA29_S44C3_POSN                     equ 0004h
LCDDATA29_S44C3_POSITION                 equ 0004h
LCDDATA29_S44C3_SIZE                     equ 0001h
LCDDATA29_S44C3_LENGTH                   equ 0001h
LCDDATA29_S44C3_MASK                     equ 0010h
LCDDATA29_S45C3_POSN                     equ 0005h
LCDDATA29_S45C3_POSITION                 equ 0005h
LCDDATA29_S45C3_SIZE                     equ 0001h
LCDDATA29_S45C3_LENGTH                   equ 0001h
LCDDATA29_S45C3_MASK                     equ 0020h
LCDDATA29_S46C3_POSN                     equ 0006h
LCDDATA29_S46C3_POSITION                 equ 0006h
LCDDATA29_S46C3_SIZE                     equ 0001h
LCDDATA29_S46C3_LENGTH                   equ 0001h
LCDDATA29_S46C3_MASK                     equ 0040h
LCDDATA29_S47C3_POSN                     equ 0007h
LCDDATA29_S47C3_POSITION                 equ 0007h
LCDDATA29_S47C3_SIZE                     equ 0001h
LCDDATA29_S47C3_LENGTH                   equ 0001h
LCDDATA29_S47C3_MASK                     equ 0080h

// Register: LCDDATA30
#define LCDDATA30 LCDDATA30
LCDDATA30                                equ 0EACh
// bitfield definitions
LCDDATA30_S48C3_POSN                     equ 0000h
LCDDATA30_S48C3_POSITION                 equ 0000h
LCDDATA30_S48C3_SIZE                     equ 0001h
LCDDATA30_S48C3_LENGTH                   equ 0001h
LCDDATA30_S48C3_MASK                     equ 0001h
LCDDATA30_S49C3_POSN                     equ 0001h
LCDDATA30_S49C3_POSITION                 equ 0001h
LCDDATA30_S49C3_SIZE                     equ 0001h
LCDDATA30_S49C3_LENGTH                   equ 0001h
LCDDATA30_S49C3_MASK                     equ 0002h
LCDDATA30_S50C3_POSN                     equ 0002h
LCDDATA30_S50C3_POSITION                 equ 0002h
LCDDATA30_S50C3_SIZE                     equ 0001h
LCDDATA30_S50C3_LENGTH                   equ 0001h
LCDDATA30_S50C3_MASK                     equ 0004h
LCDDATA30_S51C3_POSN                     equ 0003h
LCDDATA30_S51C3_POSITION                 equ 0003h
LCDDATA30_S51C3_SIZE                     equ 0001h
LCDDATA30_S51C3_LENGTH                   equ 0001h
LCDDATA30_S51C3_MASK                     equ 0008h
LCDDATA30_S52C3_POSN                     equ 0004h
LCDDATA30_S52C3_POSITION                 equ 0004h
LCDDATA30_S52C3_SIZE                     equ 0001h
LCDDATA30_S52C3_LENGTH                   equ 0001h
LCDDATA30_S52C3_MASK                     equ 0010h
LCDDATA30_S53C3_POSN                     equ 0005h
LCDDATA30_S53C3_POSITION                 equ 0005h
LCDDATA30_S53C3_SIZE                     equ 0001h
LCDDATA30_S53C3_LENGTH                   equ 0001h
LCDDATA30_S53C3_MASK                     equ 0020h
LCDDATA30_S54C3_POSN                     equ 0006h
LCDDATA30_S54C3_POSITION                 equ 0006h
LCDDATA30_S54C3_SIZE                     equ 0001h
LCDDATA30_S54C3_LENGTH                   equ 0001h
LCDDATA30_S54C3_MASK                     equ 0040h
LCDDATA30_S55C3_POSN                     equ 0007h
LCDDATA30_S55C3_POSITION                 equ 0007h
LCDDATA30_S55C3_SIZE                     equ 0001h
LCDDATA30_S55C3_LENGTH                   equ 0001h
LCDDATA30_S55C3_MASK                     equ 0080h

// Register: LCDDATA31
#define LCDDATA31 LCDDATA31
LCDDATA31                                equ 0EADh
// bitfield definitions
LCDDATA31_S56C3_POSN                     equ 0000h
LCDDATA31_S56C3_POSITION                 equ 0000h
LCDDATA31_S56C3_SIZE                     equ 0001h
LCDDATA31_S56C3_LENGTH                   equ 0001h
LCDDATA31_S56C3_MASK                     equ 0001h
LCDDATA31_S57C3_POSN                     equ 0001h
LCDDATA31_S57C3_POSITION                 equ 0001h
LCDDATA31_S57C3_SIZE                     equ 0001h
LCDDATA31_S57C3_LENGTH                   equ 0001h
LCDDATA31_S57C3_MASK                     equ 0002h
LCDDATA31_S58C3_POSN                     equ 0002h
LCDDATA31_S58C3_POSITION                 equ 0002h
LCDDATA31_S58C3_SIZE                     equ 0001h
LCDDATA31_S58C3_LENGTH                   equ 0001h
LCDDATA31_S58C3_MASK                     equ 0004h
LCDDATA31_S59C3_POSN                     equ 0003h
LCDDATA31_S59C3_POSITION                 equ 0003h
LCDDATA31_S59C3_SIZE                     equ 0001h
LCDDATA31_S59C3_LENGTH                   equ 0001h
LCDDATA31_S59C3_MASK                     equ 0008h
LCDDATA31_S60C3_POSN                     equ 0004h
LCDDATA31_S60C3_POSITION                 equ 0004h
LCDDATA31_S60C3_SIZE                     equ 0001h
LCDDATA31_S60C3_LENGTH                   equ 0001h
LCDDATA31_S60C3_MASK                     equ 0010h
LCDDATA31_S61C3_POSN                     equ 0005h
LCDDATA31_S61C3_POSITION                 equ 0005h
LCDDATA31_S61C3_SIZE                     equ 0001h
LCDDATA31_S61C3_LENGTH                   equ 0001h
LCDDATA31_S61C3_MASK                     equ 0020h
LCDDATA31_S62C3_POSN                     equ 0006h
LCDDATA31_S62C3_POSITION                 equ 0006h
LCDDATA31_S62C3_SIZE                     equ 0001h
LCDDATA31_S62C3_LENGTH                   equ 0001h
LCDDATA31_S62C3_MASK                     equ 0040h
LCDDATA31_S63C3_POSN                     equ 0007h
LCDDATA31_S63C3_POSITION                 equ 0007h
LCDDATA31_S63C3_SIZE                     equ 0001h
LCDDATA31_S63C3_LENGTH                   equ 0001h
LCDDATA31_S63C3_MASK                     equ 0080h

// Register: LCDDATA32
#define LCDDATA32 LCDDATA32
LCDDATA32                                equ 0EAEh
// bitfield definitions
LCDDATA32_S00C4_POSN                     equ 0000h
LCDDATA32_S00C4_POSITION                 equ 0000h
LCDDATA32_S00C4_SIZE                     equ 0001h
LCDDATA32_S00C4_LENGTH                   equ 0001h
LCDDATA32_S00C4_MASK                     equ 0001h
LCDDATA32_S01C4_POSN                     equ 0001h
LCDDATA32_S01C4_POSITION                 equ 0001h
LCDDATA32_S01C4_SIZE                     equ 0001h
LCDDATA32_S01C4_LENGTH                   equ 0001h
LCDDATA32_S01C4_MASK                     equ 0002h
LCDDATA32_S02C4_POSN                     equ 0002h
LCDDATA32_S02C4_POSITION                 equ 0002h
LCDDATA32_S02C4_SIZE                     equ 0001h
LCDDATA32_S02C4_LENGTH                   equ 0001h
LCDDATA32_S02C4_MASK                     equ 0004h
LCDDATA32_S03C4_POSN                     equ 0003h
LCDDATA32_S03C4_POSITION                 equ 0003h
LCDDATA32_S03C4_SIZE                     equ 0001h
LCDDATA32_S03C4_LENGTH                   equ 0001h
LCDDATA32_S03C4_MASK                     equ 0008h
LCDDATA32_S04C4_POSN                     equ 0004h
LCDDATA32_S04C4_POSITION                 equ 0004h
LCDDATA32_S04C4_SIZE                     equ 0001h
LCDDATA32_S04C4_LENGTH                   equ 0001h
LCDDATA32_S04C4_MASK                     equ 0010h
LCDDATA32_S05C4_POSN                     equ 0005h
LCDDATA32_S05C4_POSITION                 equ 0005h
LCDDATA32_S05C4_SIZE                     equ 0001h
LCDDATA32_S05C4_LENGTH                   equ 0001h
LCDDATA32_S05C4_MASK                     equ 0020h
LCDDATA32_S06C4_POSN                     equ 0006h
LCDDATA32_S06C4_POSITION                 equ 0006h
LCDDATA32_S06C4_SIZE                     equ 0001h
LCDDATA32_S06C4_LENGTH                   equ 0001h
LCDDATA32_S06C4_MASK                     equ 0040h
LCDDATA32_S07C4_POSN                     equ 0007h
LCDDATA32_S07C4_POSITION                 equ 0007h
LCDDATA32_S07C4_SIZE                     equ 0001h
LCDDATA32_S07C4_LENGTH                   equ 0001h
LCDDATA32_S07C4_MASK                     equ 0080h

// Register: LCDDATA33
#define LCDDATA33 LCDDATA33
LCDDATA33                                equ 0EAFh
// bitfield definitions
LCDDATA33_S08C4_POSN                     equ 0000h
LCDDATA33_S08C4_POSITION                 equ 0000h
LCDDATA33_S08C4_SIZE                     equ 0001h
LCDDATA33_S08C4_LENGTH                   equ 0001h
LCDDATA33_S08C4_MASK                     equ 0001h
LCDDATA33_S09C4_POSN                     equ 0001h
LCDDATA33_S09C4_POSITION                 equ 0001h
LCDDATA33_S09C4_SIZE                     equ 0001h
LCDDATA33_S09C4_LENGTH                   equ 0001h
LCDDATA33_S09C4_MASK                     equ 0002h
LCDDATA33_S10C4_POSN                     equ 0002h
LCDDATA33_S10C4_POSITION                 equ 0002h
LCDDATA33_S10C4_SIZE                     equ 0001h
LCDDATA33_S10C4_LENGTH                   equ 0001h
LCDDATA33_S10C4_MASK                     equ 0004h
LCDDATA33_S11C4_POSN                     equ 0003h
LCDDATA33_S11C4_POSITION                 equ 0003h
LCDDATA33_S11C4_SIZE                     equ 0001h
LCDDATA33_S11C4_LENGTH                   equ 0001h
LCDDATA33_S11C4_MASK                     equ 0008h
LCDDATA33_S12C4_POSN                     equ 0004h
LCDDATA33_S12C4_POSITION                 equ 0004h
LCDDATA33_S12C4_SIZE                     equ 0001h
LCDDATA33_S12C4_LENGTH                   equ 0001h
LCDDATA33_S12C4_MASK                     equ 0010h
LCDDATA33_S13C4_POSN                     equ 0005h
LCDDATA33_S13C4_POSITION                 equ 0005h
LCDDATA33_S13C4_SIZE                     equ 0001h
LCDDATA33_S13C4_LENGTH                   equ 0001h
LCDDATA33_S13C4_MASK                     equ 0020h
LCDDATA33_S14C4_POSN                     equ 0006h
LCDDATA33_S14C4_POSITION                 equ 0006h
LCDDATA33_S14C4_SIZE                     equ 0001h
LCDDATA33_S14C4_LENGTH                   equ 0001h
LCDDATA33_S14C4_MASK                     equ 0040h
LCDDATA33_S15C4_POSN                     equ 0007h
LCDDATA33_S15C4_POSITION                 equ 0007h
LCDDATA33_S15C4_SIZE                     equ 0001h
LCDDATA33_S15C4_LENGTH                   equ 0001h
LCDDATA33_S15C4_MASK                     equ 0080h

